<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
      
    

    
  

  
    
    
    <link href="//fonts.googleapis.com/css?family=方正舒体:300,300italic,400,400italic,700,700italic|华文新魏:300,300italic,400,400italic,700,700italic|华文行楷:300,300italic,400,400italic,700,700italic|Monotype Corsiva:300,300italic,400,400italic,700,700italic|Courier New:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x56DE;&amp;#x9996;2016&amp;#x3000;&amp;#x5C55;&amp;#x671B;2017">
<meta property="og:type" content="article">
<meta property="og:title" content="宝剑锋从砥砺出，梅花香自苦寒来">
<meta property="og:url" content="http://yoursite.com/2017/01/01/宝剑锋从砥砺出，梅花香自苦寒来/index.html">
<meta property="og:site_name" content="Tang-Dreamoon's Blog">
<meta property="og:description" content="&amp;#x56DE;&amp;#x9996;2016&amp;#x3000;&amp;#x5C55;&amp;#x671B;2017">
<meta property="og:updated_time" content="2017-01-01T11:05:56.734Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="宝剑锋从砥砺出，梅花香自苦寒来">
<meta name="twitter:description" content="&amp;#x56DE;&amp;#x9996;2016&amp;#x3000;&amp;#x5C55;&amp;#x671B;2017">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/2017/01/01/宝剑锋从砥砺出，梅花香自苦寒来/"/>





  <title> 宝剑锋从砥砺出，梅花香自苦寒来 | Tang-Dreamoon's Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?89f639e6f54c56b621f2d11fceb84765";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">Tang-Dreamoon's Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">stay hungry stay foolish</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://yoursite.com/2017/01/01/宝剑锋从砥砺出，梅花香自苦寒来/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="Harryang">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/images/t3.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="Tang-Dreamoon's Blog">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="Tang-Dreamoon's Blog" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                宝剑锋从砥砺出，梅花香自苦寒来
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-01-01T18:44:13+08:00">
                2017-01-01
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/❤生活❤/" itemprop="url" rel="index">
                    <span itemprop="name">~❤生活❤~</span>
                  </a>
                </span>

                
                
                  ， 
                
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/❤生活❤/日记/" itemprop="url" rel="index">
                    <span itemprop="name">日记</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x56DE;&#x9996;2016-&#x5C55;&#x671B;2017"><a href="#&#x56DE;&#x9996;2016-&#x5C55;&#x671B;2017" class="headerlink" title="&#x56DE;&#x9996;2016&#x3000;&#x5C55;&#x671B;2017"></a>&#x56DE;&#x9996;2016&#x3000;&#x5C55;&#x671B;2017</h2><a id="more"></a>
<p><font size="4"> &#x3000;&#x3000;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x5DF2;&#x7ECF;&#x5230;&#x6765;&#xFF0C;&#x5728;&#x8FD9;&#x8F9E;&#x65E7;&#x8FCE;&#x65B0;&#x4E4B;&#x9645;&#xFF0C;&#x96BE;&#x514D;&#x4F1A;&#x56DE;&#x9996;&#x5F80;&#x4E8B;&#x3001;&#x611F;&#x6168;&#x9887;&#x591A;&#xFF0C;&#x4E5F;&#x5C31;&#x66F4;&#x613F;&#x610F;&#x603B;&#x7ED3;&#x8FC7;&#x53BB;&#xFF0C;&#x5C55;&#x671B;&#x660E;&#x5929;&#x3002;</font></p>
<p><font size="4"> &#x3000;&#x3000;&#x8C08;&#x5230;2016&#xFF0C;&#x5728;&#x6211;&#x770B;&#x6765;&#x5982;&#x679C;&#x7528;&#x4E24;&#x4E2A;&#x5B57;&#x6765;&#x603B;&#x7ED3;&#x2014;&#x2014;&#x5C31;&#x662F;&#x5931;&#x8D25;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#x4E00;&#x5E74;&#x524D;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x6211;&#x610F;&#x6C14;&#x98CE;&#x53D1;&#x7684;&#x6B63;&#x5F0F;&#x8E0F;&#x5165;&#x4E86;&#x4FE1;&#x606F;&#x5B66;&#x7ADE;&#x8D5B;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x53EF;&#x5C31;&#x5728;&#x6628;&#x5929;&#x6211;&#x4EE5;&#x4E00;&#x540D;&#x4FE1;&#x606F;&#x5B66;&#x7ADE;&#x8D5B;&#x5B66;&#x751F;&#x7684;&#x8EAB;&#x4EFD;&#x9EEF;&#x7136;&#x4F24;&#x9B42;&#x7684;&#x544A;&#x522B;&#x4E86;2016&#x3002;&#x6CA1;&#x6709;&#x6210;&#x7EE9;&#x3001;&#x6CA1;&#x6709;&#x559C;&#x60A6;&#xFF0C;&#x611F;&#x89C9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x4E0D;&#x5C3D;&#x5982;&#x4EBA;&#x610F;&#x3002;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x7ED9;2016&#x753B;&#x4E0A;&#x4E86;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x7684;&#x53E5;&#x53F7;&#xFF1F;&#x6015;&#x662F;&#x53EA;&#x6709;&#x81EA;&#x5DF1;&#x4E86;&#x5427;&#x3002;&#x6CA1;&#x6709;&#x6FC0;&#x60C5;&#x7684;&#x9752;&#x6625;&#x3001;&#x6CA1;&#x6709;&#x594B;&#x6597;&#x7684;&#x9752;&#x6625;&#x3001;&#x6CA1;&#x6709;&#x7F81;&#x7ECA;&#x7684;&#x9752;&#x6625;&#xFF0C;&#x53C8;&#x80FD;&#x7559;&#x4E0B;&#x4EC0;&#x4E48;&#xFF1F;&#x6015;&#x662F;&#x53EA;&#x6709;&#x7A7A;&#x865A;&#x4E86;&#x5427;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x4EBA;&#x6210;&#x529F;&#x4E0E;&#x5426;&#x5E76;&#x4E0D;&#x5728;&#x4E8E;&#x4ED6;&#x7684;&#x6210;&#x7EE9;&#x5982;&#x4F55;&#x6216;&#x8005;&#x662F;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x5927;&#x4E8B;&#xFF0C;&#x800C;&#x662F;&#x4ED6;&#x662F;&#x5426;&#x771F;&#x7684;&#x8BA9;&#x81EA;&#x5DF1;&#x6EE1;&#x610F;&#x4E86;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#x5C31;&#x662F;&#x95EE;&#x5FC3;&#x65E0;&#x6127;&#xFF01;&#x6211;&#x4E00;&#x76F4;&#x628A;&#x8FD9;&#x51E0;&#x4E2A;&#x5B57;&#x5F53;&#x4F5C;&#x6211;&#x7684;&#x5EA7;&#x53F3;&#x94ED;&#xFF0C;&#x53EF;&#x9057;&#x61BE;&#x7684;&#x662F;&#x5728;&#x65E7;&#x7684;&#x4E00;&#x5E74;&#x91CC;&#xFF0C;&#x6211;&#x5E76;&#x6CA1;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x8D2F;&#x5F7B;&#x843D;&#x5B9E;&#x4E0B;&#x53BB;&#x3002;&#x5BF9;&#x4E8E;2016&#xFF0C;&#x6211;&#x95EE;&#x5FC3;&#x6709;&#x6127;&#x2026;&#x2026;</font></p>
<p><font size="4"> &#x3000;&#x3000;&#x7A76;&#x5176;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x662F;&#x6CA1;&#x80FD;&#x591F;&#x517B;&#x6210;&#x4E00;&#x79CD;&#x575A;&#x5353;&#x4E4B;&#x5FD7;&#xFF0C;&#x610F;&#x5FD7;&#x4E0D;&#x591F;&#x575A;&#x5B9A;&#x3002;&#x6240;&#x4EE5;&#x5BFC;&#x81F4;&#x6211;&#x5728;2016&#x5E74;&#x6CA1;&#x80FD;&#x606A;&#x5B88;&#x672C;&#x5FC3;&#xFF0C;&#x5C06;&#x8BB8;&#x591A;&#x65F6;&#x5149;&#x7528;&#x5728;&#x4E86;&#x4E0D;&#x52A1;&#x6B63;&#x4E1A;&#x4E0A;&#x3002;&#x660E;&#x4EE3;&#x5927;&#x5723;&#x8D24;&#x738B;&#x9633;&#x660E;&#x5148;&#x751F;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#xFF1A;&#x201C;&#x5FC3;&#x5916;&#x65E0;&#x7269;&#xFF0C;&#x5FC3;&#x5916;&#x65E0;&#x4E8B;&#xFF0C;&#x5FC3;&#x5916;&#x65E0;&#x7406;&#x3002;&#x201D;&#x201C;&#x5B87;&#x5B99;&#x53D1;&#x7A8D;&#x4E4B;&#x6700;&#x7CBE;&#x5904;&#xFF0C;&#x662F;&#x4EBA;&#x5FC3;&#x4E00;&#x70B9;&#x7075;&#x660E;&#x3002;&#x201D;&#x5148;&#x751F;&#x7684;&#x610F;&#x601D;&#x4FBF;&#x662F;&#x5E0C;&#x671B;&#x4EBA;&#x4EBA;&#x53EF;&#x4EE5;&#x606A;&#x5B88;&#x672C;&#x5FC3;&#x3001;&#x201C;&#x77E5;&#x884C;&#x5408;&#x4E00;&#x201D;&#xFF0C;&#x51E1;&#x4E8B;&#x7686;&#x987B;&#x8FC7;&#x95EE;&#x672C;&#x5FC3;&#x540E;&#x518D;&#x53BB;&#x505A;&#x3002;&#x800C;&#x4E14;&#x4ED6;&#x8BA4;&#x4E3A;&#xFF0C;&#x53EA;&#x8981;&#x5982;&#x6B64;&#x505A;&#x4EBA;&#x505A;&#x4E8B;&#xFF0C;&#x4FBF;&#x53EF;&#x79F0;&#x4E4B;&#x4E3A;&#x5723;&#x4EBA;&#x3002;&#x6211;&#x60F3;&#x505A;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x54EA;&#x6015;&#x4ED6;&#x529E;&#x4E8B;&#x4E0D;&#x6210;&#xFF0C;&#x5FC3;&#x4E2D;&#x4E5F;&#x5B9A;&#x5C06;&#x65E0;&#x6240;&#x9057;&#x61BE;&#xFF0C;&#x5F53;&#x53EF;&#x79F0;&#x5176;&#x4E3A;&#x6210;&#x529F;&#x4E86;&#x5427;&#x3002;&#x6E05;&#x672B;&#x4E00;&#x4EE3;&#x5927;&#x5112;&#x66FE;&#x56FD;&#x85E9;&#x8FD8;&#x66FE;&#x8BF4;&#x8FC7;&#xFF1A;&#x201C;&#x5EB8;&#x5EB8;&#x788C;&#x788C;&#x4E4B;&#x4EBA;&#x7686;&#x56E0;&#x65E0;&#x5FD7;&#x3002;&#x201D;&#x4ED6;&#x8FD8;&#x9F13;&#x52B1;&#x4EBA;&#x4EEC;&#x5E94;&#x8BE5;&#x5C3D;&#x65E9;&#x7ACB;&#x5FD7;&#xFF0C;&#x53EF;&#x8FD9;&#x91CC;&#x7684;&#x5FD7;&#x5411;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x6307;&#x968F;&#x968F;&#x4FBF;&#x4FBF;&#x7684;&#x68A6;&#x60F3;&#x66F4;&#x4E0D;&#x662F;&#x5E7B;&#x60F3;&#x3002;&#x7ACB;&#x5FD7;&#x7684;&#x8FC7;&#x7A0B;&#x5E94;&#x8BE5;&#x4F34;&#x968F;&#x7740;&#x75DB;&#x82E6;&#x4E0E;&#x56F0;&#x96BE;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x53D7;&#x5C3D;&#x5343;&#x96BE;&#x4E07;&#x9669;&#x540E;&#x624D;&#x65B9;&#x77E5;&#x6211;&#x662F;&#x6211;&#x3002;&#x800C;&#x6B63;&#x6240;&#x8C13;&#x4E3A;&#x65E0;&#x5FD7;&#x4E4B;&#x4EBA;&#x5E38;&#x7ACB;&#x5FD7;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x5FD7;&#x5411;&#x662F;&#x575A;&#x5B9A;&#x7684;&#x3001;&#x662F;&#x4E98;&#x5B88;&#x5982;&#x4E00;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7763;&#x4FC3;&#x4EBA;&#x4EEC;&#x594B;&#x53D1;&#x5411;&#x4E0A;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x78E8;&#x7EC3;&#x4EBA;&#x4EEC;&#x7684;&#x5FC3;&#x6027;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x9762;&#x5BF9;&#x5200;&#x5C71;&#x706B;&#x6D77;&#x8FD8;&#x662F;&#x8FF7;&#x4EBA;&#x6E29;&#x5E8A;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x575A;&#x5B88;&#x81EA;&#x5DF1;&#x5FC3;&#x7075;&#x7684;&#x4E00;&#x70B9;&#x7075;&#x660E;&#x3002;&#x800C;&#x50CF;&#x8FD9;&#x6837;&#x6709;&#x4E86;&#x5982;&#x94C1;&#x4E00;&#x822C;&#x7684;&#x610F;&#x5FD7;&#xFF0C;&#x4E3A;&#x5185;&#x5FC3;&#x642D;&#x5EFA;&#x4E86;&#x5982;&#x94DC;&#x5899;&#x94C1;&#x58C1;&#x4E00;&#x822C;&#x7684;&#x5821;&#x5792;&#x7684;&#x4EBA;&#xFF0C;&#x54EA;&#x91CC;&#x7528;&#x62C5;&#x5FC3;&#x6709;&#x4EC0;&#x4E48;&#x4E8B;&#x4F1A;&#x505A;&#x4E0D;&#x6210;&#x5462;&#xFF1F;&#x6211;&#x60F3;&#x505A;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x54EA;&#x6015;&#x4ED6;&#x9047;&#x5230;&#x56F0;&#x96BE;&#xFF0C;&#x5FC3;&#x4E2D;&#x4E5F;&#x5B9A;&#x5C06;&#x65E0;&#x6240;&#x754F;&#x60E7;&#xFF0C;&#x5F53;&#x53EF;&#x79F0;&#x5176;&#x4E3A;&#x6210;&#x529F;&#x4E86;&#x5427;&#x3002;</font></p>
<p><font size="4"> &#x3000;&#x3000;&#x4E0D;&#x8FC7;&#xFF0C;&#x7EB5;&#x4F7F;&#x662F;&#x5931;&#x8D25;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x5931;&#x8D25;&#x7684;&#x597D;&#x5904;&#x3002;&#x4EBA;&#x751F;&#x96BE;&#x514D;&#x6709;&#x8BB8;&#x591A;&#x6CE2;&#x6F9C;&#x58EE;&#x9614;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x800C;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#xFF0C;&#x4FBF;&#x662F;&#x4EBA;&#x751F;&#x7684;&#x538B;&#x8231;&#x77F3;&#xFF0C;&#x800C;&#x538B;&#x8231;&#x77F3;&#x5F80;&#x5F80;&#x53EF;&#x4EE5;&#x52A9;&#x6211;&#x4EEC;&#x4E58;&#x98CE;&#x7834;&#x6D6A;&#x3001;&#x8D70;&#x7684;&#x66F4;&#x8FDC;&#x3002;&#x6211;&#x60F3;2016&#x8FD8;&#x662F;&#x6559;&#x4F1A;&#x4E86;&#x6211;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x7684;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#x5176;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4FBF;&#x662F;&#x81EA;&#x6211;&#x53CD;&#x7701;&#xFF0C;&#x82CF;&#x683C;&#x62C9;&#x5E95;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#xFF1A;&#x201C;&#x672A;&#x7ECF;&#x5BA1;&#x89C6;&#x7684;&#x4EBA;&#x751F;&#x662F;&#x4E0D;&#x503C;&#x5F97;&#x8FC7;&#x7684;&#x201D;&#x3002;&#x201C;&#x543E;&#x65E5;&#x4E09;&#x7701;&#x543E;&#x8EAB;&#x201D;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x505A;&#x5230;&#x201C;&#x77E5;&#x884C;&#x5408;&#x4E00;&#x201D;&#x3001;&#x606A;&#x5B88;&#x5982;&#x4E00;&#x7684;&#x5FC5;&#x7ECF;&#x4E4B;&#x8DEF;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x91CC;&#x6211;&#x8981;&#x6BCF;&#x5929;&#x603B;&#x7ED3;&#x5199;&#x65E5;&#x8BB0;&#x3001;&#x53CD;&#x7701;&#x81EA;&#x6211;&#x3001;&#x81EA;&#x6211;&#x5256;&#x6790;&#x3002;&#x5176;&#x6B21;&#x5C31;&#x662F;&#x6211;&#x5BF9;&#x505A;&#x4EBA;&#x6709;&#x4E86;&#x65B0;&#x7684;&#x8BA4;&#x8BC6;&#x548C;&#x76EE;&#x6807;&#x3002;&#x5B5F;&#x5B50;&#x66FE;&#x8BF4;&#xFF1A;&#x201C;&#x543E;&#x517B;&#x543E;&#x6D69;&#x7136;&#x6B63;&#x6C14;&#x3002;&#x201D;&#x505A;&#x4E00;&#x4E2A;&#x6B63;&#x76F4;&#x7684;&#x4EBA;&#x3001;&#x505A;&#x4E00;&#x4E2A;&#x5766;&#x8361;&#x7684;&#x4EBA;&#x3001;&#x505A;&#x4E00;&#x4E2A;&#x80F8;&#x6000;&#x5929;&#x4E0B;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x4E00;&#x4E2A;&#x7537;&#x4EBA;&#x3002;&#x66FE;&#x56FD;&#x85E9;&#x53C8;&#x8A00;&#xFF1A;&#x201C;&#x81EA;&#x53E4;&#x5931;&#x8D25;&#x4E4B;&#x4EBA;&#x975E;&#x50B2;&#x5373;&#x60F0;&#x3002;&#x201D;&#x505A;&#x4E00;&#x4E2A;&#x53CB;&#x5584;&#x7684;&#x4EBA;&#x3001;&#x505A;&#x4E00;&#x4E2A;&#x52E4;&#x594B;&#x7684;&#x4EBA;&#x3001;&#x505A;&#x4E00;&#x4E2A;&#x6709;&#x4EC1;&#x7231;&#x4E4B;&#x5FC3;&#x7684;&#x4EBA;&#xFF0C;&#x7262;&#x8BB0;&#x201C;&#x75C5;&#x4ECE;&#x53E3;&#x5165;&#xFF0C;&#x7978;&#x4ECE;&#x53E3;&#x51FA;&#x201D;&#x3001;&#x523B;&#x8584;&#x4E4B;&#x8A00;&#x5BB3;&#x4EBA;&#x5BB3;&#x5DF1;&#x3001;&#x4E00;&#x5206;&#x8015;&#x8018;&#x4E00;&#x5206;&#x6536;&#x83B7;&#x3001;&#x5C06;&#x5FC3;&#x6BD4;&#x5FC3;&#x624D;&#x53EF;&#x5171;&#x540C;&#x8FDB;&#x6B65;&#x3002;&#x5B50;&#x66F0;&#xFF1A;&#x201C;&#x6055;&#x4E5F;&#xFF0C;&#x5DF1;&#x6240;&#x4E0D;&#x6B32;&#xFF0C;&#x52FF;&#x65BD;&#x4E8E;&#x4EBA;&#x201D;&#xFF0C;&#x4EE5;&#x5927;&#x80F8;&#x6000;&#x3001;&#x5927;&#x6C14;&#x9B44;&#x5305;&#x5BB9;&#x4ED6;&#x4EBA;&#x3001;&#x5305;&#x5BB9;&#x4E07;&#x7269;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#xFF01;&#x800C;&#x5BF9;&#x4E8E;&#x65F6;&#x4EE3;&#xFF0C;&#x6211;&#x4E5F;&#x6709;&#x4E86;&#x65B0;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x65F6;&#x4EE3;&#x548C;&#x793E;&#x4F1A;&#x7684;&#x4EF7;&#x503C;&#x4E0D;&#x5728;&#x4E8E;&#x901F;&#x5EA6;&#xFF0C;&#x800C;&#x5728;&#x4E8E;&#x7B49;&#x5F85;&#x3002;&#x6B63;&#x5982;&#x65E0;&#x8BBA;&#x817E;&#x8BAF;&#x804A;&#x5929;&#x591A;&#x4E48;&#x8FC5;&#x6377;&#xFF0C;&#x4E5F;&#x8FDC;&#x4E0D;&#x5982;&#x4E00;&#x5C01;&#x4FE1;&#x66F4;&#x8BA9;&#x4EBA;&#x671F;&#x5F85;&#x3002;&#x6536;&#x4FE1;&#x4E4B;&#x4EBA;&#x6216;&#x8BB8;&#x5728;&#x6E29;&#x548C;&#x7684;&#x5348;&#x540E;&#xFF0C;&#x6216;&#x8BB8;&#x5728;&#x4F24;&#x5FC3;&#x6B32;&#x7EDD;&#x7684;&#x6DF1;&#x591C;&#xFF0C;&#x90FD;&#x5C06;&#x6709;&#x4E00;&#x79CD;&#x6E29;&#x99A8;&#x7684;&#x5FEB;&#x4E50;&#x3001;&#x6709;&#x4E00;&#x79CD;&#x610F;&#x5916;&#x7684;&#x60CA;&#x559C;&#xFF1B;&#x800C;&#x5BC4;&#x4FE1;&#x4E4B;&#x4EBA;&#x66F4;&#x4F1A;&#x6709;&#x4E00;&#x79CD;&#x6DE1;&#x6DE1;&#x7684;&#x671F;&#x5F85;&#xFF0C;&#x5E7B;&#x60F3;&#x7740;&#x5BF9;&#x65B9;&#x5728;&#x770B;&#x5230;&#x4FE1;&#x540E;&#x7684;&#x573A;&#x9762;&#xFF0C;&#x90A3;&#x79CD;&#x201C;&#x8D60;&#x4EBA;&#x73AB;&#x7470;&#xFF0C;&#x624B;&#x7559;&#x4F59;&#x9999;&#x201D;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x662F;&#x591A;&#x4E48;&#x5730;&#x8BA9;&#x4EBA;&#x5F7B;&#x591C;&#x96BE;&#x7720;&#xFF1F;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x5C31;&#x5982;&#x540C;&#x54C1;&#x4E00;&#x58F6;&#x6E05;&#x8317;&#xFF0C;&#x6CA1;&#x6709;&#x6162;&#x6162;&#x7684;&#x7B49;&#x5F85;&#x548C;&#x7EC6;&#x7EC6;&#x7684;&#x54C1;&#x5473;&#x662F;&#x4E0D;&#x9999;&#x7684;&#x3002;</font></p>
<p><font size="4"> &#x3000;&#x3000;&#x5E0C;&#x671B;&#x7684;&#x98CE;&#x5E06;&#x7EC8;&#x7A76;&#x8981;&#x542F;&#x822A;&#xFF0C;&#x662F;&#x65F6;&#x5019;&#x5C55;&#x671B;&#x4E00;&#x4E0B;2017&#x4E86;&#xFF01;&#x65B0;&#x7684;&#x5F81;&#x7A0B;&#x4E0A;&#x771F;&#x5FC3;&#x611F;&#x8C22;&#x6709;&#x4F60;&#x76F8;&#x4F34;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x52AA;&#x529B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#xFF1A;</font></p>
<p><font size="4"> &#x3000;&#x3000;&#x7559;&#x4E0B;&#x4E00;&#x4E1D;&#x7F81;&#x7ECA;&#xFF0C;&#x65A9;&#x65AD;&#x4E00;&#x4EFD;&#x7737;&#x604B;&#xFF1B;&#x7559;&#x4E0B;&#x4E00;&#x4E1D;&#x94ED;&#x8BB0;&#xFF0C;&#x65A9;&#x65AD;&#x4E00;&#x4EFD;&#x6094;&#x6068;&#xFF1B;&#x7559;&#x4E0B;&#x4E00;&#x4E1D;&#x7F8E;&#x597D;&#xFF0C;&#x65A9;&#x65AD;&#x4E00;&#x4EFD;&#x4E89;&#x7AEF;&#xFF1B;&#x7559;&#x4E0B;&#x4E00;&#x4E1D;&#x5E0C;&#x5180;&#xFF0C;&#x65A9;&#x65AD;&#x4E00;&#x4EFD;&#x68A6;&#x5E7B;&#xFF1B;&#x7559;&#x4E0B;&#x4E00;&#x4E1D;&#x62FC;&#x640F;&#xFF0C;&#x65A9;&#x65AD;&#x4E00;&#x4EFD;&#x6175;&#x61D2;&#x2026;&#x2026;&#x52A0;&#x6CB9;&#x5427;&#xFF01;&#x5144;&#x5F1F;&#x4EEC;&#xFF01;&#x52A0;&#x6CB9;&#x5427;&#xFF01;2017&#xFF01;&#x8BA9;&#x6211;&#x4EEC;&#x5411;&#x65E0;&#x6094;&#x7684;&#x9752;&#x6625;&#x5927;&#x58F0;&#x7684;&#x53D1;&#x51FA;&#x6211;&#x4EEC;&#x7684;&#x8A93;&#x8A00;&#xFF1A;&#x95EE;&#x5FC3;&#x65E0;&#x6127;&#x7684;&#x5C81;&#x6708;&#x624D;&#x662F;&#x90A3;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x5C81;&#x6708;&#xFF01;</font></p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/01/01/记一次考试/" rel="next" title="记一次考试">
                <i class="fa fa-chevron-left"></i> 记一次考试
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/01/01/bzoj-2160-拉拉队/" rel="prev" title="bzoj 2160 拉拉队排练">
                bzoj 2160 拉拉队排练 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/t3.png"
               alt="Harryang" />
          <p class="site-author-name" itemprop="name">Harryang</p>
          <p class="site-description motion-element" itemprop="description">自己选择的路，跪着也要走完！</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">46</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">20</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              OI神犇
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.cnblogs.com/neighthorn/" title="sxy" target="_blank">sxy</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.cnblogs.com/dugudashen/" title="lmy" target="_blank">lmy</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.cnblogs.com/juruolty/" title="lty" target="_blank">lty</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.cnblogs.com/ezyzy/" title="yzy" target="_blank">yzy</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.cnblogs.com/yousiki/" title="ysq" target="_blank">ysq</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://blog.csdn.net/qq_31785871" title="ryc" target="_blank">ryc</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://blog.csdn.net/mirrorgray?viewmode=contents" title="dz-lyh" target="_blank">dz-lyh</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="https://oblivious137.github.io/" title="dy-lh" target="_blank">dy-lh</a>
                </li>
              
            </ul>
          </div>
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#回首2016-展望2017"><span class="nav-number">1.</span> <span class="nav-text">回首2016　展望2017</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2016 - 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Harryang</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  



  




	




  
  

  

  

  

  


</body>
</html>
